**Dataframes** - a 2-dimensional labeled data structure with columns of potentially different data types.

In [1]:
import pandas as pd
import numpy as np

In [2]:
# creating a dataframe using pd.DataFrame function

from numpy.random import randint
np.random.seed(100)

df = pd.DataFrame(randint(0,100,(4,4)))
df

    0   1   2   3
0   8  24  67  87
1  79  48  10  94
2  52  98  53  66
3  98  14  34  24

In [3]:
np.random.seed(100)
df = pd.DataFrame(randint(0,100,(4,4)), index = ['Deng', 'Brian', 'George', 'Lynne'],\
                 columns = ['MD1', 'MD2', 'MD3', 'MD4'])  # MD = Match Day

df

        MD1  MD2  MD3  MD4
Deng      8   24   67   87
Brian    79   48   10   94
George   52   98   53   66
Lynne    98   14   34   24

Atrributes of a dataframe

In [4]:
print("Type of df :", type(df))

print("Shape of df :", df.shape)

print("Index of df :", df.index)

print("Columns of the df :", df.columns)

Type of df : <class 'pandas.core.frame.DataFrame'>
Shape of df : (4, 4)
Index of df : Index(['Deng', 'Brian', 'George', 'Lynne'], dtype='object')
Columns of the df : Index(['MD1', 'MD2', 'MD3', 'MD4'], dtype='object')

Selecting columns from a DataFrame

In [5]:
df

        MD1  MD2  MD3  MD4
Deng      8   24   67   87
Brian    79   48   10   94
George   52   98   53   66
Lynne    98   14   34   24

In [6]:
print(df['MD1']) # selecting columns from a dataframe

print('\nAnother way to select a column is:')

df.MD1

Deng       8
Brian     79
George    52
Lynne     98
Name: MD1, dtype: int32

Another way to select a column is:

Deng       8
Brian     79
George    52
Lynne     98
Name: MD1, dtype: int32

In [7]:
type(df['MD2']) # datatype of columns in a dataframe

pandas.core.series.Series

In [8]:
# selecting multiple columns from a DataFrame

df[['MD2', 'MD3']]

        MD2  MD3
Deng     24   67
Brian    48   10
George   98   53
Lynne    14   34

Creating a new column in a DataFrame

In [9]:
df['Total_score'] = df['MD1'] + df['MD2'] + df['MD3'] + df['MD4']

df

        MD1  MD2  MD3  MD4  Total_score
Deng      8   24   67   87          186
Brian    79   48   10   94          231
George   52   98   53   66          269
Lynne    98   14   34   24          170

Dropping columns and rows of a DataFrame

In [10]:
# dropping columns

# df.drop('Total_score', axis = 1) # dropping total_score column from the dataframe
# df.drop('MD4', axis = 1)
df.drop(['MD1', 'MD2'], axis = 1) # dropping multiple columns

        MD3  MD4  Total_score
Deng     67   87          186
Brian    10   94          231
George   53   66          269
Lynne    34   24          170

In [11]:
df

        MD1  MD2  MD3  MD4  Total_score
Deng      8   24   67   87          186
Brian    79   48   10   94          231
George   52   98   53   66          269
Lynne    98   14   34   24          170

In [12]:
# inplace = truenis used to permanently drop a column

df.drop('Total_score', axis = 1, inplace = True)

In [13]:
df

        MD1  MD2  MD3  MD4
Deng      8   24   67   87
Brian    79   48   10   94
George   52   98   53   66
Lynne    98   14   34   24

In [14]:
# dropping rows

df.drop('Deng', axis = 0)

        MD1  MD2  MD3  MD4
Brian    79   48   10   94
George   52   98   53   66
Lynne    98   14   34   24

Inspecting data withhin a DataFrame using pd.loc and pd.iloc function

In [15]:
# selecting row by index name

df

        MD1  MD2  MD3  MD4
Deng      8   24   67   87
Brian    79   48   10   94
George   52   98   53   66
Lynne    98   14   34   24

In [16]:
df.loc['Deng'] # selecting a row using a row index name

MD1     8
MD2    24
MD3    67
MD4    87
Name: Deng, dtype: int32

In [17]:
# selecting a value using row index and column name

print(df.loc['Deng', 'MD4'])

87

In [18]:
# selecting a subset of rows and columns using their names

df.loc[['Deng', 'Brian'], ['MD2', 'MD3']]

       MD2  MD3
Deng    24   67
Brian   48   10

In [19]:
# selecting a range of rows and columns using their names

df.loc['Deng': 'George','MD1':'MD3']

        MD1  MD2  MD3
Deng      8   24   67
Brian    79   48   10
George   52   98   53

In [20]:
df

        MD1  MD2  MD3  MD4
Deng      8   24   67   87
Brian    79   48   10   94
George   52   98   53   66
Lynne    98   14   34   24

In [21]:
# integer location - iloc
# selecting a row using an index number

df.iloc[2]

MD1    52
MD2    98
MD3    53
MD4    66
Name: George, dtype: int32

In [22]:
# selecting a value using row and column index

df.iloc[0,2]

np.int32(67)

In [23]:
# selecting a subset of rows using their indices

df.iloc[[0,2], [1,3]]

        MD2  MD4
Deng     24   87
George   98   66

In [24]:
# selecting a range of rows and columns using their indices

df.iloc[0:2, 1:3]

       MD2  MD3
Deng    24   67
Brian   48   10

**1. Introduction to missing data**

In [25]:
'''None keyword is used to represent missing values in Py built-in data structure
Numpy uses nan to represent a missingnumber and Pandas uses NAN to rep missing value in its dataframe
numpy.nan is a floating representation of Not a Number which is of type float. However, None is of NoneType'''

'None keyword is used to represent missing values in Py built-in data structure\nNumpy uses nan to represent a missingnumber and Pandas uses NAN to rep missing value in its dataframe\nnumpy.nan is a floating representation of Not a Number which is of type float. However, None is of NoneType'

In [26]:
# type(np.nan)
type(None)

NoneType

In [27]:
# representing missing values in an array and a dataframe

np.array([1, np.nan, 3, None])

# object dtype in pandas or numpy is a text or mixed numeric or non-numeric values

array([1, nan, 3, None], dtype=object)

In [28]:
df = pd.DataFrame({'A': ['x','y',np.nan,'y',np.nan],
                  'B': [5, None,np.nan, 'x', np.nan],
                  'C': [1, np.nan, 3, None, np.nan],
                  'D': [10,np.nan, 30, np.nan, np.nan]})
df

     A     B    C     D
0    x     5  1.0  10.0
1    y  None  NaN   NaN
2  NaN   NaN  3.0  30.0
3    y     x  NaN   NaN
4  NaN   NaN  NaN   NaN

In [29]:
# df.dtypes  # determining data type of columns in a dataframe
df.info()  # determining attributes of a dataframe

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       3 non-null      object
 1   B       2 non-null      object
 2   C       2 non-null      float64
 3   D       2 non-null      float64
dtypes: float64(2), object(2)
memory usage: 292.0+ bytes

dropping rows and columns with NaN values with df.dropna() method

In [30]:
df

     A     B    C     D
0    x     5  1.0  10.0
1    y  None  NaN   NaN
2  NaN   NaN  3.0  30.0
3    y     x  NaN   NaN
4  NaN   NaN  NaN   NaN

In [31]:
df.dropna()  # dropping rows where at least one element is missing or NaN

   A  B    C     D
0  x  5  1.0  10.0

In [32]:
df.dropna(axis = 1)  # dropping columns where at least one element is missing or NaN

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3, 4]

In [33]:
df.dropna(how = 'all')  # dropping rows if all values are NaN.

     A     B    C     D
0    x     5  1.0  10.0
1    y  None  NaN   NaN
2  NaN   NaN  3.0  30.0
3    y     x  NaN   NaN

In [34]:
df.dropna(how = 'any')  # dropping rows if any value is NaN

   A  B    C     D
0  x  5  1.0  10.0

In [35]:
df.dropna(thresh = 2) # keep only the rows with at least 2 non- NaN values

     A    B    C     D
0    x    5  1.0  10.0
2  NaN  NaN  3.0  30.0
3    y    x  NaN   NaN

Filling NaN values with df.fillna() method

In [36]:
df.fillna(value = 0)

   A  B    C     D
0  x  5  1.0  10.0
1  y  0  0.0   0.0
2  0  0  3.0  30.0
3  y  x  0.0   0.0
4  0  0  0.0   0.0

In [37]:
df.fillna(value = df.mean(numeric_only=True)) # replacing mean with missing values for all the integer columns

     A     B    C     D
0    x     5  1.0  10.0
1    y  None  2.0  20.0
2  NaN   NaN  3.0  30.0
3    y     x  2.0  20.0
4  NaN   NaN  2.0  20.0

In [38]:
df['C'].fillna(value = df['C'].mean()) # replacing mean with missing values for an integer column

0    1.0
1    2.0
2    3.0
3    2.0
4    2.0
Name: C, dtype: float64

In [39]:
# df['A'].fillna(value = df['A'].mode().iloc[0])
df['B'].fillna(value = df['B'].mode().iloc[0])

C:\Users\USER\AppData\Local\Temp\ipykernel_14472\587896510.py:2: UserWarning: Unable to sort modes: '<' not supported between instances of 'str' and 'int'
  df['B'].fillna(value = df['B'].mode().iloc[0])

0    5
1    5
2    5
3    x
4    5
Name: B, dtype: object

In [40]:
fill_value = {'A': 0, 'B': 1, 'C': 2, 'D': 3}

df.fillna(value = fill_value)  # using dict to replace NaN values

   A  B    C     D
0  x  5  1.0  10.0
1  y  1  2.0   3.0
2  0  1  3.0  30.0
3  y  x  2.0   3.0
4  0  1  2.0   3.0

Forward filling and backward filling rowwise and columnwise

In [41]:
df

     A     B    C     D
0    x     5  1.0  10.0
1    y  None  NaN   NaN
2  NaN   NaN  3.0  30.0
3    y     x  NaN   NaN
4  NaN   NaN  NaN   NaN

In [42]:
# df.fillna(method = 'ffill')  # along the row axis
df.fillna(method = 'bfill')

C:\Users\USER\AppData\Local\Temp\ipykernel_14472\114419757.py:2: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df.fillna(method = 'bfill')

     A    B    C     D
0    x    5  1.0  10.0
1    y    x  3.0  30.0
2    y    x  3.0  30.0
3    y    x  NaN   NaN
4  NaN  NaN  NaN   NaN

In [43]:
df.fillna(method = 'ffill', axis = 1)  # along the column axis
# df.fillna(method = 'bfill', axis = 1)

C:\Users\USER\AppData\Local\Temp\ipykernel_14472\2466598636.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df.fillna(method = 'ffill', axis = 1)  # along the column axis
C:\Users\USER\AppData\Local\Temp\ipykernel_14472\2466598636.py:1: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  df.fillna(method = 'ffill', axis = 1)  # along the column axis

     A    B    C     D
0    x    5  1.0  10.0
1    y    y    y     y
2  NaN  NaN  3.0  30.0
3    y    x    x     x
4  NaN  NaN  NaN   NaN

**Miscellaneous methods**

In [44]:
df.isnull() # generate a boolean mask indicating missing values

       A      B      C      D
0  False  False  False  False
1  False   True   True   True
2   True   True  False  False
3  False  False   True   True
4   True   True   True   True

In [46]:
df.notnull()  # opposite of isnull()

       A      B      C      D
0   True   True   True   True
1   True  False  False  False
2  False  False   True   True
3   True   True  False  False
4  False  False  False  False